tap "caskroom/versions"

brew "vim"
brew "git"
brew "git-subrepo"
brew "the_silver_searcher"
brew "coreutils"
brew "gnu-sed"
brew "gnu-getopt"
brew "gnupg"
brew "watch"
brew "tree"
brew "telnet"
brew "wget"
brew "jq"

brew "asdf"

cask "adoptopenjdk"
cask "adoptopenjdk8"
brew "gradle"
brew "maven"
brew "leiningen"

brew "r"
brew "bats-core"

cask "1password"
cask "iterm2"
cask "spectacle"
cask "firefox"
cask "waterfox"
cask "visual-studio-code"
cask "intellij-idea"
cask "rstudio"
cask "docker"
cask "vagrant"
cask "squidman"

