tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "vim"
brew "git"
brew "git-subrepo"
brew "the_silver_searcher"
brew "grep"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-getopt"
brew "gnupg"
brew "watch"
brew "entr"
brew "tree"
brew "telnet"
brew "ngrep"
brew "wget"
brew "jq"
brew "autojump"
brew "ipcalc"
brew "imagemagick"
brew "bash-completion"

# asdf plugin dependencies
brew "openssl"

brew "asdf"
brew "leiningen"
cask "dotnet-sdk"
brew "r"
brew "bats-core"

brew "awscli"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "kind"
brew "helm"

cask "1password"
cask "iterm2"
brew "svn" # SVN is removed in Xcode 11.4 but it is used during install of font-inconsolata-g-for-powerline
cask "font-inconsolata-g-for-powerline"
cask "hammerspoon"
cask "firefox"
cask "google-chrome"
cask "visual-studio-code"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "rstudio"
cask "vagrant"
brew "vagrant-completion"
cask "squidman"
cask "libreoffice"
cask "drawio"
cask "calibre4"
cask "vlc"
cask "visualvm"
cask "wireshark"
cask "superduper"
cask "barrier"
