brew "vim"
brew "git"
brew "git-subrepo"
brew "the_silver_searcher"
brew "grep"
brew "bash"
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-getopt"
brew "watch"
brew "entr"
brew "tree"
brew "telnet"
brew "ngrep"
brew "wget"
brew "jq"
brew "zoxide"
brew "ipcalc"
brew "imagemagick"
brew "powerline-go"
brew "fdupes"
brew "exiftool"

# asdf plugin dependencies
brew "openssl"

brew "asdf"
brew "leiningen"
cask "dotnet-sdk"
brew "r"
brew "shellcheck"

brew "awscli"
brew "colima"
brew "qemu"
brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "docker-credential-helper"
brew "kubectl"
brew "kind"
brew "helm"
cask "virtualbox"
cask "parallels"

cask "1password"
cask "1password-cli"
cask "iterm2"
brew "svn" # SVN is removed in Xcode 11.4 but it is used during install of font-inconsolata-g-for-powerline
cask "font-inconsolata-g-for-powerline"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "maccy"
cask "firefox"
cask "google-chrome"
cask "visual-studio-code"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "rstudio"
cask "squidman"
cask "libreoffice"
cask "drawio"
cask "calibre"
cask "vlc"
cask "visualvm"
cask "wireshark-app"
cask "superduper"
cask "zoom"

vscode "MS-vsliveshare.vsliveshare" unless ENV["CI"]
vscode "betterthantomorrow.calva" unless ENV["CI"]
vscode "ms-dotnettools.csharp" unless ENV["CI"]
vscode "Orta.vscode-jest" unless ENV["CI"]
vscode "sumneko.lua" unless ENV["CI"]
vscode "hashicorp.terraform" unless ENV["CI"]
vscode "ms-azuretools.vscode-docker" unless ENV["CI"]
vscode "ms-kubernetes-tools.vscode-kubernetes-tools" unless ENV["CI"]
vscode "timonwong.shellcheck" unless ENV["CI"]
vscode "redhat.vscode-yaml" unless ENV["CI"]
vscode "redhat.vscode-xml" unless ENV["CI"]
